Revit 2027 API
AreaReinforcementLayerType Enumeration
 Describes the layers of an Area Reinforcement
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum AreaReinforcementLayerType
Public Enumeration AreaReinforcementLayerType
public enum class AreaReinforcementLayerType
type AreaReinforcementLayerType
Members
Member name | Value | Description
BottomOrBackMajor | 2 |  Reinforcement layer is on the bottom face of a floor host, or on the back face of a wall host in the major direction.
BottomOrBackMinor | 3 |  Reinforcement layer is on the bottom face of a floor host, or on the back face of a wall host in the minor direction.
TopOrFrontMajor | 0 |  Reinforcement layer is on the top face of a floor host, or on the front face of a wall host in the major direction.
TopOrFrontMinor | 1 |  Reinforcement layer is on the top face of a floor host, or on the front face of a wall host in the minor direction.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace